
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.РеализацияТоваров.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваров.Дата,
	|	РеализацияТоваров.Клиент,
	|	РеализацияТоваров.Номер,
	|	РеализацияТоваров.Сортировка,
	|	РеализацияТоваров.Товары.(
	|		НомерСтроки,
	|		Товар,
	|		Количество,
	|		Цена,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.РеализацияТоваров КАК РеализацияТоваров
	|ГДЕ
	|	РеализацияТоваров.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТоварыШапка = Макет.ПолучитьОбласть("ТоварыШапка");
	ОбластьТовары = Макет.ПолучитьОбласть("Товары");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТоварыШапка);
		
		ТЗТовары = Новый ТаблицаЗначений;
		ТЗТовары.Колонки.Добавить("НомерСтроки");
		ТЗТовары.Колонки.Добавить("Товар");
		ТЗТовары.Колонки.Добавить("Количество");
		ТЗТовары.Колонки.Добавить("Цена");
		ТЗТовары.Колонки.Добавить("Сумма");
		ТЗТовары.Колонки.Добавить("Длина");
		
		ВыборкаТовары = Выборка.Товары.Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл    
			
			СтрокаТЧ = ТЗТовары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, ВыборкаТовары);
	
		КонецЦикла;  
		
		
		Для Каждого СтрокаТовара из ТЗТовары Цикл 

			НаименованиеТовара = СокрЛП(СтрокаТовара.Товар);
			СтрокаТовара.Длина = СтрДлина(НаименованиеТовара);
		
		КонецЦикла; 
		
		Если Ссылка[0].Сортировка = Перечисления.ВидыСортировки.ПоНаименованию тогда
			ТЗТовары.Сортировать("Товар");
		ИначеЕсли Ссылка[0].Сортировка = Перечисления.ВидыСортировки.ПоЦене тогда
			ТЗТовары.Сортировать("Цена");
		ИначеЕсли Ссылка[0].Сортировка = Перечисления.ВидыСортировки.ПоДлиннеНаименования тогда 
			ТЗТовары.Сортировать("Длина");
		КонецЕсли;
		
		
		
		Для Каждого СтрокаТовара из ТЗТовары Цикл
			
			ОбластьТовары.Параметры.Заполнить(СтрокаТовара);
			ТабДок.Вывести(ОбластьТовары);
		
		КонецЦикла; 
		
		
		

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры


