
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;  
	РаботаСтабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);

КонецПроцедуры     


&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;  
	РаботаСтабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);

КонецПроцедуры


&НаКлиенте
Процедура ТоварыТоварПриИзменении(Элемент)
	ТекДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	Если ЗначениеЗаполнено(ТекДанные.Товар) Тогда
		ТекДанные.Цена = ПолучитьЦенуНаСервере(ТекДанные.Товар);
	Иначе 
		 ТекДанные.Цена = 0;
	КонецЕсли ;

КонецПроцедуры   
&НаСервереБезКонтекста
Функция ПолучитьЦенуНаСервере(Товары)
 Возврат Товары.Цена	
КонецФункции


